#=============================================================================
# ■ Add-On 随机属性装备  by 老鹰（http://oneeyedeagle.lofter.com/）
# ※ 本插件需要放置在【装备附加属性-核心 by老鹰】与
#   【装备附加属性-随机规则 by老鹰】之下
#=============================================================================
# - 2019.4.28.22
#=============================================================================
# - 本插件实现了简单的随机属性装备的获取与丢失
#--------------------------------------------------------------------------
# -【推荐】结合 物品帮助增强 来显示属性（http://rpg.blue/thread-372464-1-1.html）
#=============================================================================
module EQUIP_EX
  #--------------------------------------------------------------------------
  # ○ 常量：敌人掉落装备将具有随机属性？
  #--------------------------------------------------------------------------
  ENEMY_DROP = true
  #--------------------------------------------------------------------------
  # ○ 常量：商店购买装备将具有随机属性？
  #--------------------------------------------------------------------------
  SHOP_BUY = true
  #--------------------------------------------------------------------------
  # ○ 生成随机属性装备
  #--------------------------------------------------------------------------
  def self.new_equip_ex(item)
    return item unless can_ex?(item)
    attrs = EQUIP_EX.new_attrs(item)
    id_ex = EQUIP_EX.new_ex(item, attrs)
    EQUIP_EX.get_equip(item, id_ex)
  end
end
#=============================================================================
# ○ 绑定队伍失去物品
#=============================================================================
class Game_Party < Game_Unit
  #--------------------------------------------------------------------------
  # ● 减少物品
  #     include_equip : 是否包括装备
  #--------------------------------------------------------------------------
  alias eagle_equip_ex_lose_item lose_item
  def lose_item(item, amount, include_equip = false)
    eagle_equip_ex_lose_item(item, -amount, include_equip)
    EQUIP_EX.delete_ex(item)
  end
end
#=============================================================================
# ○ 绑定敌人掉落
#=============================================================================
class Game_Enemy < Game_Battler
  #--------------------------------------------------------------------------
  # ● 生成物品数组
  #--------------------------------------------------------------------------
  alias eagle_equip_ex_make_drop_items make_drop_items
  def make_drop_items
    drops = eagle_equip_ex_make_drop_items
    drops = drops.collect { |e| EQUIP_EX.new_equip_ex(e) } if EQUIP_EX::ENEMY_DROP
    drops
  end
end
#=============================================================================
# ○ 绑定商店购买
#=============================================================================
class Scene_Shop < Scene_MenuBase
  #--------------------------------------------------------------------------
  # ● （覆盖）执行买入
  #--------------------------------------------------------------------------
  def do_buy(number)
    $game_party.lose_gold(number * buying_price)
    if EQUIP_EX::SHOP_BUY
      number.times do
        item = EQUIP_EX.new_equip_ex(@item)
        $game_party.gain_item(item, 1)
      end
    else
      $game_party.gain_item(@item, number)
    end
  end
end
