#==============================================================================
# ■ Add-On 战斗并行对话 by 老鹰（http://oneeyedeagle.lofter.com/）
# ※ 本插件需要放置在【Add-On 并行对话 by老鹰】之下
#==============================================================================
# - 2019.9.18.0
#==============================================================================
# - 本插件新增了可用于在战斗中呼叫指定sym名称的并行对话功能
#--------------------------------------------------------------------------
# ○ 编写与战斗者相关的并行对话
#--------------------------------------------------------------------------
# - 此类并行对话必须为预设对话，且“标签序列”的唯一名称按以下格式编写
#
#    主动方标志+主动方id+_+目标方标志+目标方id
#
#   其中 主动方标志 与 目标方标志 为 字母a（代表角色） 或 字母e（代表敌人）
#   其中 主动方id 与 目标方id 为对应的在数据库中的id编号
#
#   其余与原始并行对话一致
#--------------------------------------------------------------------------
# ○ 战斗事件中调用
#--------------------------------------------------------------------------
# - 利用事件脚本 b_msg(v, a_id, b) 呼叫指定并行对话
#   其中 v 为对话编号，若传入负数，则为 1~负数绝对值 中的一个随机数
#   其中 a_id 对应的角色为对话主动方
#             若传入正数，则代表角色数据库id，
#             若传入负数，则代表敌人index，
#             若省略，取数据库1号角色
#   其中 b 对应的角色为对话目标方
#          若传入正数，则代表角色数据库id
#          若传入负数，则代表敌人index
#          若传入 Game_Battler 对象，则直接取它
#          若传入 Game_Battler 对象数组，则随机取其中一个，
#          若省略，取当前敌群中随机一个敌人
# - 示例：
#     b_msg(1, 4, -1) 将呼叫名称为 :a4_e1_1 的并行对话
#     b_msg(-3, -1, 1) 将呼叫名称为 :e1_a1_1 :e1_a1_2 :e1_a1_3 中的一个并行对话
#     b_msg(-2, 3) 将随机选取战场上一名存活敌人，其数据库id为(id)，
#         呼叫名称为 :a3_e(id)_1 :a3_e(id)_2 中的一个并行对话
#
#--------------------------------------------------------------------------
# ○ 技能公式中调用
#--------------------------------------------------------------------------
# - 在技能公式中，利用 a.b_msg(v, b) 呼叫
#   其中 a 为对话主动方，b 为目标方，均为 Game_Battler 对象
#   v 与上述一致
#   若省略 b，则取当前敌群中随机一个敌人
#==============================================================================

class Game_Battler
  #--------------------------------------------------------------------------
  # ● 呼叫指定的并行对话
  #--------------------------------------------------------------------------
  def b_msg(v, b = nil)
    b = $game_troop.alive_members if b.nil?
    b = b[rand(b.size)] if b.is_a?(Array)
    s = (self.actor? ? "a#{self.id}_" : "e#{self.enemy_id}_")
    s += (b.enemy? ? "e#{b.enemy_id}_" : "a#{b.id}_")
    s += (v >= 0 ? "#{v}" : "#{rand(v.abs)+1}")
    MESSAGE_PARA.call(s.to_sym)
  end
end

class Game_Interpreter
  #--------------------------------------------------------------------------
  # ● 呼叫指定的并行对话
  #--------------------------------------------------------------------------
  def b_msg(v, a_id = 1, b = nil)
    if b.is_a?(Integer)
      if b > 0
        b = $game_party.members.select {|a| a.actor.id == b }[0]
      elsif b < 0
        b = $game_troop.members[b.abs]
      else
        return
      end
    end
    if a_id > 0
      $game_party.members.select {|a| a.actor.id == a_id }[0].b_msg(v, b)
    elsif a_id < 0
      $game_troop.members[a_id.abs].b_msg(v, b)
    end
  end
end
