module STORY_MAP
  #--------------------------------------------------------------------------
  # ● 常量：设置每行的名称
  #--------------------------------------------------------------------------
  NAME_LINES = { 
    # 行名称的数组
    :data => ["支线1","支线2","支线3"], 
    # 行名称的高度 
    :h => 100,
  }
  #--------------------------------------------------------------------------
  # ● 常量：设置每列的名称
  #--------------------------------------------------------------------------
  NAME_COLS  = { 
    # 列名称的数组
    :data => ["清晨","上午","正午","下午","傍晚","深夜"],
    # 列名称的宽度
    :w => 180,
  }
  #--------------------------------------------------------------------------
  # ● 常量：设置每个剧情节点
  #--------------------------------------------------------------------------
  NODES = {
  #------------------------------------------------------------------------
  # 【必须】该节点在脚本中的名称，需要保证唯一性
    "1-1" => { 
      #------------------------------------------------------------------------
      # 【必须】该节点的横轴所在位置
      #  （若设置为数字，则为直接的坐标）
      #  （若设置为字符串，则为所在列，将与对应列的位置对齐）
      :x => "支线1",
      #------------------------------------------------------------------------
      # 【必须】该节点的纵轴所在位置
      #  （若设置为数字，则为直接的坐标）
      #  （若设置为字符串，则为所在列，将与对应列的位置对齐）
      :y => "清晨", 
      #------------------------------------------------------------------------
      # 【必须】该节点的显示名称
      :name => "测试用",
      #------------------------------------------------------------------------
      # 【可选】该节点的宽度
      #  （若未设置，则取显示名称的宽度）
      #:w => 100,
      #------------------------------------------------------------------------
      # 【可选】该节点的背景图
      #  （设置为数字时，0=窗口皮肤背景，1=暗色背景，2=透明）
      #  （设置为字符串时，为Graphics/System目录下的对应名称的图片）
      :bg => "node_bg",
      #------------------------------------------------------------------------
      # 【可选】该节点的出现条件
      #  （数组，其中均为字符串，将逐个eval并判定返回值是否为true）
      #  （若其中有一个结果不为true，则隐藏该节点）
      #  （如果该节点已经解锁，则不再判定）
      # :if => [""],
      #------------------------------------------------------------------------
      # 【可选】该节点未解锁时，鼠标/键盘点击后的提示文本
      :hint => "完成<主线：一切的开始>后解锁",
      #------------------------------------------------------------------------
      # 【可选】该节点解锁后，鼠标/键盘点击时能否查看详细信息
      #  （若不填写，默认 true，可以点击放大查看详细信息）
      # :no_click => true,
      #------------------------------------------------------------------------
      # 【可选】该节点解锁后，鼠标/键盘点击后的显示位置和缩放倍率
      #  （数字，若不填写或为nil，则取 NODE_X2 、NODE_Y2 、NODE_ZOOM2 ）
      #  （该位置为 节点中心点 的屏幕上坐标）
      :x2 => nil, 
      :y2 => nil,
      :zoom2 => 1.0,
      #------------------------------------------------------------------------
      # 【可选】该节点解锁后，鼠标/键盘点击后显示的详细信息
      #  （数组，其中每一项均对应一个显示的精灵）
      :info => [ 
        #【插入文本】
        # [:text, "需要显示的字符串", 
        #   [显示原点类型, x坐标, y坐标, z值],
        #   [点击效果类型, 相关参数]
        # ]
        #
        #【插入图片】
        # [:pic, "需要显示的图片的名称", 
        #   [显示原点类型, x坐标, y坐标, z值],
        #   [点击效果类型, 相关参数]
        # ]
        #
        # 其中，[点击效果类型, 相关参数]为：
        #
        # 【类型一：场所移动】
        #   [:move, 目的地地图ID，目的地地图x，目的地地图y]
        #
        # 【类型二：读档】
        #  （只有当解锁时同步存了档才有效）
        #   [:load]
        #
        # 【类型三：执行脚本】
        #   [:ruby, "字符串"]
        #
        # 【类型四：呼叫指定事件】
        # （必须使用【呼叫指定事件 by 老鹰】）
        #   [:event, 事件所在地图ID, 事件ID, 事件页ID]
        #
        [:text, "这是一句测试用语句\n点击后将执行1号地图的5号事件。", 
          [7, 100,300,1], [:event, 1,5,0] ],
        [:text, "这是另一句测试用语句\n点击后将退出当前UI并将玩家直接移动到2号地图(10,10)位置。", 
          [7, 300,500,1], [:move, 2,10,10] ],
        [:text, "点击后将读取与该节点脚本名称一致的存档。", 
          [7, 200,700,1], [:load] ],
      ],
    },

    "1-2" => { :x => "守城方", :y => "新历122年", :name => "测试用2", :bg=>0,
      :hint => "完成<主线：一切的开始>后解锁", # 如果没有解锁，点击时弹出的提示文本
    },
    "1-3" => { :x => "守城方", :y => "新历123年", :pic => "node_bg", },
    "1-4" => { :x => "反叛军", :y => "新历123年", :name => "测试用", :bg=>1 },
  }
  #--------------------------------------------------------------------------
  # ● 常量：设置节点之间的连线
  #--------------------------------------------------------------------------
  LINES = [
    # 第一项为连线参数，之后按顺序取出两个作为一组连线
    [{},"1-1","1-2", "1-2","1-3"], 
    [],
  ]
#--------------------------------------------------------------------------
end  # 必须的模块结尾，不要漏掉
