#==============================================================================
# ■ 大体型事件 by 老鹰（https://github.com/OneEyedEagle/EAGLE-RGSS3）
# ※ 本插件需要放置在【组件-通用方法汇总 by老鹰】之下
#==============================================================================
$imported ||= {}
$imported["EAGLE-BigEvent"] = "1.0.0"
#==============================================================================
# - 2026.9.28.11 
#==============================================================================
# - 本插件新增了可以占多个格子的事件。
#=============================================================================

#-----------------------------------------------------------
# ○ 设置方式
#-----------------------------------------------------------
#
# - 事件页首个指令为 注释 时，写入下列文本：
#
#      <大体型>...</大体型>
#
#   其中 ... 可以替换成下列项目的组合
#
#      ox=小数  →  设置事件图像的水平方向对齐位置。
#                   默认 0.5 ，即事件图像的垂直中轴线与所在地图格的垂直中轴线对齐。
#                   若设置的比 0.5 小，则会把事件图像往右移，反之往左移。
#
#      oy=小数  →  设置事件图像的竖直方向对齐位置。
#                   默认 1.0 ，即事件图像的底部位置与所在地图格的底部对齐。
#                   若设置的比 1.0 小，则会把事件图像往下移，反之往上移。
#
#      xy=坐标|坐标|...  → 设置额外占据的地图格子。
#                      其中 坐标 为 数字,数字 的组合，是当前所在位置的偏移量，
#                      如 1,0 是事件当前地图格右边的那格，0,1 是事件下面那一格。
#  
#-----------------------------------------------------------
# ○ 使用例子
#-----------------------------------------------------------
# 
#   <大体型>ox=0.25 xy=1,0</大体型>
#
#       → 该事件占据了 2 格，当前格及右边一格。
#
#   <大体型>ox=0.25 xy=0,0-1</大体型>
#
#       → 该事件占据了 2 格，当前格及上面一格。
#
#   <大体型>ox=0.25 xy=1,0|0,-1|1,-1</大体型>
#
#       → 该事件占据了 4 格，当前格及右边一格、上面一格、右上一格。
#
#-----------------------------------------------------------
# ○ 注意
#-----------------------------------------------------------
#
# 1. 对于额外占据的地图格，玩家无法通行、按键同样能触发事件执行。
#
# 2. 若未设置 xy，仅修改了 ox 和 oy，则只是在视觉上移动了图像，不会自动判定。
#
#-----------------------------------------------------------
# ○ 高级
#-----------------------------------------------------------
#
# - 利用该方法获取事件的周围一圈坐标的数组：
#
#     event.surrounding_pos(dir8=true)
#
#   若传入 true ，则是八方向计算相邻坐标，若 false 则是计算四方向。
#
#=============================================================================

module EAGLE_COMMON
  #--------------------------------------------------------------------------
  # ○【常量】匹配注释的正则
  #--------------------------------------------------------------------------
  COMMENT_BIG_EVENT = /^<大体型>(.*?)<\/大体型>/mi
end

class Game_Event < Game_Character
  attr_reader  :eagle_ox, :eagle_oy, :eagle_pos
  #--------------------------------------------------------------------------
  # ● 初始化公有成员变量
  #--------------------------------------------------------------------------
  alias eagle_big_event_init_public_members init_public_members
  def init_public_members
    eagle_big_event_init_public_members
    @eagle_ox = 0.5
    @eagle_oy = 1.0
    @eagle_pos = []
  end
  #--------------------------------------------------------------------------
  # ● 坐标一致判定
  #--------------------------------------------------------------------------
  def pos?(x, y)
    (@x == x && @y == y) ||
    @eagle_pos.any? { |xy| (@x+xy[0]) == x && (@y+xy[1]) == y }
  end
  #--------------------------------------------------------------------------
  # ● 设置事件页的设置
  #--------------------------------------------------------------------------
  alias eagle_big_event_setup_page_settings setup_page_settings
  def setup_page_settings
    eagle_big_event_setup_page_settings
    t = EAGLE_COMMON.event_comment_head(@list)
    t =~ EAGLE_COMMON::COMMENT_BIG_EVENT
    return if $1 == nil
    ps = EAGLE_COMMON.parse_tags($1)
    @eagle_ox = ps[:ox].to_f if ps[:ox]
    @eagle_oy = ps[:oy].to_f if ps[:oy]
    if ps[:xy]  # "1,0|-1,0"
      @eagle_pos = ps[:xy].split('|').collect { |t| 
        t.split(',').collect { |v| v.to_i }
      }
    end
  end
  #--------------------------------------------------------------------------
  # ● 获取事件的邻近格子
  #--------------------------------------------------------------------------
  DIRS4 = [[0, -1], [0, 1], [-1, 0], [1, 0]]
  DIRS8 = [
    [-1, -1], [0, -1], [1, -1],
    [-1,  0],          [1,  0],
    [-1,  1], [0,  1], [1,  1]
  ]
  def surrounding_pos(dir8=true)
    dirs = dir8 ? DIRS8 : DIRS4
    around = []
    # 对于占据的全部格子，往外扩一圈
    ([[0, 0]] + @eagle_pos).each do |xy|
      dirs.each do |dxy|
        v = [@x + xy[0] + dxy[0], @y + xy[1] + dxy[1]]
        around << v if !around.include?(v)
      end
    end
    # 删除自己占据的格子
    ([[0, 0]] + @eagle_pos).each do |xy|
      around.delete([@x+xy[0], @y+xy[1]])
    end
    return around.sort_by { |xy| [xy[0], xy[1]] }
  end
end

class Sprite_Character < Sprite_Base
  #--------------------------------------------------------------------------
  # ● 设置角色的位图
  #--------------------------------------------------------------------------
  alias eagle_big_event_set_character_bitmap set_character_bitmap
  def set_character_bitmap
    eagle_big_event_set_character_bitmap
    if @character.is_a?(Game_Event)
      self.ox = @cw * @character.eagle_ox 
      self.oy = @ch * @character.eagle_oy
    end
  end
end
