#==============================================================================
# ■ 快速存读档 by 老鹰（http://oneeyedeagle.lofter.com/）
#==============================================================================
$imported ||= {}
$imported["EAGLE-FastSL"] = true
#==============================================================================
# - 2020.10.30.16 适配新版对话框
#==============================================================================
# - 本插件提供了一套基础的按键存读档接口，并且已经绑定在地图的刷新中
#------------------------------------------------------------------------------
# - 在地图上，按下对应按键可以快速存档/读档指定档位
# - 注意：
#  ·在事件执行时同样可以进行存读档，但是由于默认VA机制，
#     除了当前执行的事件，其他事件的状态并不会被保存
#  ·由于默认Game_Interpreter事件解释器中，选择框利用了无法被序列化的Proc类，
#     因此当选项出现时，使用存档功能会出现存储失败的情况；
#     但如果用了其他选择框实现（譬如 AddOn-选择框扩展 by老鹰）覆盖默认Proc方式，
#     则可在选择框开启时进行存档（请注意，由于事件内部逻辑，读档后会直接进行选项，
#     而不会再显示存档前跟着选择框一同停留的对话框）
#------------------------------------------------------------------------------
# - 高级：
#  ·在需要允许进行快速存读档的场景中，新增 FastSL.update 即可增加该绑定，
#     但请注意，所存储的内容依旧为 DataManager 中的设置内容，默认不保存其他场景信息
#  ·在 save_success 方法处理存储成功后的操作，其中可以增加其它的提示内容
#    （譬如已经新增了利用 AddOn-并行对话 by老鹰 生成的对话框文本提示）
#==============================================================================

module FastSL
  #--------------------------------------------------------------------------
  # ● 【常量】控制是否允许快速存读档的开关ID
  #--------------------------------------------------------------------------
  S_ID_SL = 0
  #--------------------------------------------------------------------------
  # ● 【常量】控制快速存储档位序号的变量ID
  #--------------------------------------------------------------------------
  V_ID_FILE_INDEX = 9
  #--------------------------------------------------------------------------
  # ● 快速存档的按键判定成功？
  #--------------------------------------------------------------------------
  def self.save?
    Input.trigger?(:L)
  end
  #--------------------------------------------------------------------------
  # ● 快速读档的按键判定成功？
  #--------------------------------------------------------------------------
  def self.load?
    Input.trigger?(:R)
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def self.update
    return if $game_switches[S_ID_SL] && $game_switches[S_ID_SL] == false
    return FastSL.save if FastSL.save?
    return FastSL.load if FastSL.load?
  end
  #--------------------------------------------------------------------------
  # ● 执行快速存档
  #--------------------------------------------------------------------------
  def self.save
    index = $game_variables[V_ID_FILE_INDEX]
    return save_success if DataManager.save_game(index)
    Sound.play_buzzer
  end
  #--------------------------------------------------------------------------
  # ● 执行快速存档成功
  #--------------------------------------------------------------------------
  def self.save_success
    if $imported["EAGLE-MessagePara"]
      t = "<msg>\\win[do-8o5dx0dy200w0h0fw1fh1z500]\\ins快速存储成功！</msg>"
      MESSAGE_PARA.add(:fast_save, t)
    end
    Sound.play_save
  end
  #--------------------------------------------------------------------------
  # ● 执行快速读档
  #--------------------------------------------------------------------------
  def self.load
    index = $game_variables[V_ID_FILE_INDEX]
    return load_success if DataManager.load_game(index)
    Sound.play_buzzer
  end
  #--------------------------------------------------------------------------
  # ● 快速读档成功
  #--------------------------------------------------------------------------
  def self.load_success
    Sound.play_load
    fadeout_all
    $game_system.on_after_load
    SceneManager.goto(Scene_Map)
  end
  #--------------------------------------------------------------------------
  # ● 淡出各种音效以及图像
  #--------------------------------------------------------------------------
  def self.fadeout_all(time = 1000)
    RPG::BGM.fade(time)
    RPG::BGS.fade(time)
    RPG::ME.fade(time)
    Graphics.fadeout(time * Graphics.frame_rate / 1000)
    RPG::BGM.stop
    RPG::BGS.stop
    RPG::ME.stop
  end
end
#=============================================================================
# ○ Game_Map
#=============================================================================
class Game_Map
  #--------------------------------------------------------------------------
  # ● 更新画面
  #     main : 事件解释器更新的标志
  #--------------------------------------------------------------------------
  alias eagle_fast_sl_update update
  def update(main = false)
    eagle_fast_sl_update(main)
    FastSL.update
  end
end
