#==============================================================================
# ■ Add-On 自定义文字移出 by 老鹰（http://oneeyedeagle.lofter.com/）
# ※ 本插件需要放置在【对话框扩展 by老鹰】与【UI移动控制 by老鹰】之下
#==============================================================================
# - 2020.6.6.21
#==============================================================================
# - 本插件为对话框的文字精灵新增自定义的移出模式
#----------------------------------------------------------------------------
# - 对话框中新增了转义符 \eout[type] 用于指定使用的移出模式
#    （优先级高于位于本插件上方的其他移出方式）
#
#     type → 传入数字，指定 EAGLE_UI_MOVE_TYPE 中的移出类型
#
# 【注意】
#
#    “指令序列”的最后一项，需要固定为 eval:obj.finish ，用于结束文字的移动
#==============================================================================

#=============================================================================
# ○ 【设置部分】
#=============================================================================
module MESSAGE_EX
  #--------------------------------------------------------------------------
  # ● 【常量】定义 type → UI移动控制的参数
  # （具体写法请参考【UI移动控制 by老鹰】中的注释）
  #--------------------------------------------------------------------------
  EAGLE_UI_MOVE_TYPE = {
    # type => ["string", {params}],
    1 => ["vy:-5; ay:1; t:60; eval:obj.finish", {}],
  }
  #--------------------------------------------------------------------------
  # ● 【常量】定义参数默认值
  #--------------------------------------------------------------------------
  EOUT_PARAMS_INIT = {
  # \eout[]
    :type => nil,
  }
end
#==============================================================================
# ○ 定义能够响应的文字特效
#==============================================================================
module MESSAGE_EX::CHARA_EFFECTS
  #--------------------------------------------------------------------------
  # ● UI移动控制
  #--------------------------------------------------------------------------
  def eagle_chara_effect_eout(param = '')
  end
end
#=============================================================================
# ○ 单个文字的精灵
#=============================================================================
class Sprite_EagleCharacter < Sprite
  #--------------------------------------------------------------------------
  # ● 处理移出模式
  #--------------------------------------------------------------------------
  alias eagle_ui_move_process_move_out process_move_out
  def process_move_out
    return move_out_eout(@params[:eout]) if @params[:eout] && !@params[:eout].empty?
    eagle_ui_move_process_move_out
  end
  #--------------------------------------------------------------------------
  # ● UI移动控制的移出
  #--------------------------------------------------------------------------
  def start_effect_eout(params, param_s)
    params[:type] = nil
    parse_param(params, param_s, :type)
    if params[:type].nil? || MESSAGE_EX::EAGLE_UI_MOVE_TYPE[params[:type]].nil?
      params.clear
    end
  end
  def move_out_eout(params)
    arr = MESSAGE_EX::EAGLE_UI_MOVE_TYPE[params[:type]]
    EAGLE_UI_MOVE.new(self, arr[0], arr[1])
    @flag_update_pos = false # 阻止自身的更新
    @flag_move = nil
  end
end
